<!--
 * AlignMiddleIcon
 * 表格工具栏：垂直居中对齐图标
-->
<template>
  <svg class="shared-icon shared-icon--fit" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" aria-hidden="true" focusable="false">
    <path d="M8,10.5c0-.28.22-.5.5-.5h7c.28,0,.5.22.5.5s-.22.5-.5.5h-7c-.28,0-.5-.22-.5-.5ZM8.5,13c-.28,0-.5.22-.5.5s.22.5.5.5h7c.28,0,.5-.22.5-.5s-.22-.5-.5-.5h-7ZM16.5,5c1.38,0,2.5,1.12,2.5,2.5v9c0,1.38-1.12,2.5-2.5,2.5H7.5c-1.38,0-2.5-1.12-2.5-2.5V7.5c0-1.38,1.12-2.5,2.5-2.5h9ZM16.5,6H7.5c-.83,0-1.5.67-1.5,1.5v9c0,.83.67,1.5,1.5,1.5h9c.83,0,1.5-.67,1.5-1.5h0V7.5c0-.83-.67-1.5-1.5-1.5Z" fill="currentColor" />
  </svg>
</template>
