<!--
 * packages/renderer-ui/src/icons/ui/ExportTxtIcon.vue
 * "导出为TXT"图标组件
-->
<template>
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
      <path d="M17.52,18.8c0,.23-.19.42-.42.42H6.9c-.23,0-.42-.19-.42-.42V5.2c0-.23.19-.42.42-.42h5.1v3.83c0,.94.76,1.7,1.7,1.7h3.83v8.5ZM13.27,5.73l3.3,3.3h-2.87c-.23,0-.42-.19-.42-.42,0,0,0-2.87,0-2.87ZM18.3,8.95l-4.95-4.95s-.05-.04-.07-.06c-.06-.06-.12-.11-.19-.15-.03-.02-.07-.04-.11-.06-.06-.03-.12-.07-.18-.1-.17-.07-.35-.11-.53-.12-.04,0-.08-.01-.12-.01h-5.25c-.94,0-1.7.76-1.7,1.7v13.6c0,.94.76,1.7,1.7,1.7h10.2c.94,0,1.7-.76,1.7-1.7v-8.65c0-.45-.18-.88-.5-1.2Z" fill="currentColor" stroke-width="0"/>
      <g>
        <path d="M9.97,14.96v-1.24h-.33v-.28l.35-.02.04-.63h.31v.63h.61v.3h-.61v1.25c0,.27.09.43.34.43.08,0,.18-.03.25-.06l.07.28c-.13.04-.28.08-.42.08-.47,0-.63-.3-.63-.74Z" fill="currentColor" stroke="currentColor" stroke-miterlimit="10" stroke-width=".1"/>
        <path d="M11.79,14.48l-.68-1.07h.41l.3.49c.07.13.14.25.22.37h.02c.07-.13.13-.25.2-.37l.28-.49h.39l-.68,1.1.73,1.12h-.41l-.33-.52c-.07-.14-.16-.27-.24-.4h-.02c-.08.13-.15.26-.23.4l-.3.52h-.39l.73-1.16Z" fill="currentColor" stroke="currentColor" stroke-miterlimit="10" stroke-width=".1"/>
        <path d="M13.37,14.96v-1.24h-.33v-.28l.35-.02.04-.63h.31v.63h.61v.3h-.61v1.25c0,.27.09.43.34.43.08,0,.18-.03.25-.06l.07.28c-.13.04-.28.08-.42.08-.47,0-.63-.3-.63-.74Z" fill="currentColor" stroke="currentColor" stroke-miterlimit="10" stroke-width=".1"/>
      </g>
    </svg>
</template>

<script setup lang="ts">
// 导出为TXT图标组件
</script>