<!--
 * FontSizeDecreaseIcon
 * 表格工具栏：减小字号图标
-->
<template>
  <svg class="shared-icon shared-icon--fit" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" aria-hidden="true" focusable="false">
    <path d="M13.65,5.15c.2-.2.51-.2.71,0,0,0,0,0,0,0l1.65,1.65,1.65-1.65c.2-.2.51-.2.71,0,.2.2.2.51,0,.71l-2,2c-.2.2-.51.2-.71,0l-2-2c-.2-.2-.2-.51,0-.71,0,0,0,0,0,0h0ZM10.5,7c.2,0,.39.12.46.31l4.5,11c.1.26-.02.55-.27.65-.26.1-.55-.02-.65-.27l-1.54-3.76v.07h-5v-.07l-1.54,3.76c-.1.26-.4.38-.65.27-.26-.1-.38-.4-.27-.65h0l4.5-11c.08-.19.26-.31.46-.31ZM8.38,14h4.24l-2.12-5.18-2.12,5.18Z" fill="currentColor" />
  </svg>
</template>
