<!-- packages/renderer-ui/src/icons/ui/ResearchIcon.vue -->
<!-- 该文件是一个“研究”图标，用于表示“深度研究 / 研究模式”状态的 SVG 图标组件 -->
<template>
  <svg class="shared-icon shared-icon--em" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" aria-hidden="true" focusable="false">
    <path
      d="M9,4.5c0-.28.22-.5.5-.5h2c.28,0,.5.22.5.5v.5h.5c.28,0,.5.22.5.5v1.53s.07,0,.11,0c3.57.34,6.2,3.51,5.86,7.08-.19,2.01-1.3,3.81-3.01,4.89h2.53c.28,0,.5.22.5.5s-.22.5-.5.5H5.5c-.28,0-.5-.22-.5-.5s.22-.5.5-.5h7c3.04,0,5.5-2.45,5.51-5.49,0-2.85-2.17-5.23-5.01-5.49v5.48c0,.28-.22.5-.5.5h-.5v.5c0,.83-.67,1.5-1.5,1.5s-1.5-.67-1.5-1.5v-.5h-.5c-.28,0-.5-.22-.5-.5V5.5c0-.28.22-.5.5-.5h.5v-.5ZM10,14v.5c0,.28.22.5.5.5s.5-.22.5-.5v-.5h-1ZM9,13h3v-7h-3v7ZM7.5,17c-.28,0-.5.22-.5.5s.22.5.5.5h6c.28,0,.5-.22.5-.5s-.22-.5-.5-.5h-6Z"
      fill="currentColor"
    />
  </svg>
</template>

<script setup lang="ts">
// 研究 / 深度研究 图标
</script>
